grevaillot/svd_tools/headers/STM32F446/sdmmc.h
/** @defgroup sdmmc_sdmmc_idmabase0r SDMMCIDMABASE0R The SDMMC_IDMABASE0R register contains the memory buffer base address in single buffer configuration and the buffer 0 base address in double buffer configuration.
@{*/


#define SDMMC_SDMMC_IDMABASE0R_IDMABASE0_SHIFT		0
#define SDMMC_SDMMC_IDMABASE0R_IDMABASE0_MASK		0xffffffff
/** @defgroup sdmmc_sdmmc_idmabase0r_idmabase0 IDMABASE0 Buffer 0 memory base address bits [31:2], shall be word aligned (bit [1:0] are always 0 and read only). This register can be written by firmware when DPSM is inactive (DPSMACT = 0), and can dynamically be written by firmware when DPSM active (DPSMACT = 1) and memory buffer 0 is inactive (IDMABACT = 1).
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc_sdmmc_idmabase1r SDMMCIDMABASE1R The SDMMC_IDMABASE1R register contains the double buffer configuration second buffer memory base address.
@{*/


#define SDMMC_SDMMC_IDMABASE1R_IDMABASE1_SHIFT		0
#define SDMMC_SDMMC_IDMABASE1R_IDMABASE1_MASK		0xffffffff
/** @defgroup sdmmc_sdmmc_idmabase1r_idmabase1 IDMABASE1 Buffer 1 memory base address, shall be word aligned (bit [1:0] are always 0 and read only). This register can be written by firmware when DPSM is inactive (DPSMACT = 0), and can dynamically be written by firmware when DPSM active (DPSMACT = 1) and memory buffer 1 is inactive (IDMABACT = 0).
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc_sdmmc_respcmdr SDMMCRESPCMDR The SDMMC_RESPCMDR register contains the command index field of the last command response received. If the command response transmission does not contain the command index field (long or OCR response), the RESPCMD field is unknown, although it must contain 111111b (the value of the reserved field from the response).
@{*/


#define SDMMC_SDMMC_RESPCMDR_RESPCMD_SHIFT		0
#define SDMMC_SDMMC_RESPCMDR_RESPCMD_MASK		0x3f
/** @defgroup sdmmc_sdmmc_respcmdr_respcmd RESPCMD Response command index Read-only bit field. Contains the command index of the last command response received.
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc_sdmmc_fifor SDMMCFIFOR The receive and transmit FIFOs can be only read or written as word (32-bit) wide registers. The FIFOs contain 16 entries on sequential addresses. This allows the CPU to use its load and store multiple operands to read from/write to the FIFO.When accessing SDMMC_FIFOR with half word or byte access an AHB bus fault is generated.
@{*/


#define SDMMC_SDMMC_FIFOR_FIFODATA_SHIFT		0
#define SDMMC_SDMMC_FIFOR_FIFODATA_MASK		0xffffffff
/** @defgroup sdmmc_sdmmc_fifor_fifodata FIFODATA Receive and transmit FIFO data This register can only be read or written by firmware when the DPSM is active (DPSMACT=1). The FIFO data occupies 16 entries of 32-bit words.
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc_sdmmc_ver SDMMCVER SDMMC IP version register
@{*/


#define SDMMC_SDMMC_VER_MAJREV_SHIFT		4
#define SDMMC_SDMMC_VER_MAJREV_MASK		0x0f
/** @defgroup sdmmc_sdmmc_ver_majrev MAJREV IP major revision number.
@{*/
/**@}*/


#define SDMMC_SDMMC_VER_MINREV_SHIFT		0
#define SDMMC_SDMMC_VER_MINREV_MASK		0x0f
/** @defgroup sdmmc_sdmmc_ver_minrev MINREV IP minor revision number.
@{*/
/**@}*/


/**@}*/

/** @defgroup sdmmc_sdmmc_id SDMMCID SDMMC IP identification register
@{*/


#define SDMMC_SDMMC_ID_IP_ID_SHIFT		0
#define SDMMC_SDMMC_ID_IP_ID_MASK		0xffffffff
/** @defgroup sdmmc_sdmmc_id_ip_id IPID SDMMC IP identification.
@{*/
/**@}*/


/**@}*/
